website/system-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-01 Thu 21:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Setup: VirtualBox, Linux and Emacs</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">My Setup: VirtualBox, Linux and Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org80d5eb4">System Setup</a>
<ul>
<li><a href="#org25599b7">VirtualBox</a>
<ul>
<li><a href="#org8f1c2c8">Download VirtualBox</a></li>
<li><a href="#orgf948dca">Download Xubuntu</a></li>
<li><a href="#org909fd9a">Configuration</a></li>
</ul>
</li>
<li><a href="#orgf2c084c">Linux</a>
<ul>
<li><a href="#orgbe65609">Xubuntu</a></li>
<li><a href="#org7809eef">Manjaro (Arch)</a></li>
</ul>
</li>
<li><a href="#orgba92fe6">Emacs</a>
<ul>
<li><a href="#org2655b01">Layout</a></li>
<li><a href="#orgebee6ca">Python IDE</a></li>
<li><a href="#orgef06f39">Org Mode</a></li>
<li><a href="#org2898b2d">Babel</a></li>
<li><a href="#orga805576">Honorable Mention: Literate Programming</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org80d5eb4" class="outline-2">
<h2 id="org80d5eb4">System Setup</h2>
<div class="outline-text-2" id="text-org80d5eb4">
</div><div id="outline-container-org25599b7" class="outline-3">
<h3 id="org25599b7">VirtualBox</h3>
<div class="outline-text-3" id="text-org25599b7">
<p>
I chose to use VirtualBox as I have to do some work in Excel and code in VBA. VirtualBox's seamless mode is a game changer. Here's how to set it up
</p>
</div>
<div id="outline-container-org8f1c2c8" class="outline-4">
<h4 id="org8f1c2c8">Download VirtualBox</h4>
<div class="outline-text-4" id="text-org8f1c2c8">
<ul class="org-ul">
<li>Download VirtualBox from their <a href="https://www.virtualbox.org/wiki/Downloads">official site</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf948dca" class="outline-4">
<h4 id="orgf948dca">Download Xubuntu</h4>
</div>
<div id="outline-container-org909fd9a" class="outline-4">
<h4 id="org909fd9a">Configuration</h4>
</div>
</div>
<div id="outline-container-orgf2c084c" class="outline-3">
<h3 id="orgf2c084c">Linux</h3>
<div class="outline-text-3" id="text-orgf2c084c">
<p>
As mentioned, I only kept Windows for my daily consulting work. Most people from the corporate world are still heavily relying on Windows and MS Office. I use Windows only to code in Excel VBA or create decks in PowerPoint (Though wish I could figure how to make beautiful slides with Emacs and LaTex)
</p>
</div>
<div id="outline-container-orgbe65609" class="outline-4">
<h4 id="orgbe65609">Xubuntu</h4>
<div class="outline-text-4" id="text-orgbe65609">
<ul class="org-ul">
<li>Ubuntu is taking too much resources with the unity desktop</li>
<li>Xubuntu is an extremely stable and efficient version of Ubuntu using xfce desktop. Simple and Reliable</li>
</ul>
</div>
</div>
<div id="outline-container-org7809eef" class="outline-4">
<h4 id="org7809eef">Manjaro (Arch)</h4>
</div>
</div>
<div id="outline-container-orgba92fe6" class="outline-3">
<h3 id="orgba92fe6">Emacs</h3>
<div class="outline-text-3" id="text-orgba92fe6">
<p>
Maybe the best thing ever invented (and not just for computer science)! Here are a list of my Emacs settings:
</p>
</div>
<div id="outline-container-org2655b01" class="outline-4">
<h4 id="org2655b01">Layout</h4>
</div>
<div id="outline-container-orgebee6ca" class="outline-4">
<h4 id="orgebee6ca">Python IDE</h4>
</div>
<div id="outline-container-orgef06f39" class="outline-4">
<h4 id="orgef06f39">Org Mode</h4>
</div>
<div id="outline-container-org2898b2d" class="outline-4">
<h4 id="org2898b2d">Babel</h4>
</div>
<div id="outline-container-orga805576" class="outline-4">
<h4 id="orga805576">Honorable Mention: Literate Programming</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-01 Thu 21:32</p>
<p class="validation"></p>
</div>
</body>
</html>
